Podkova/src/InformationRegisters/ОстаткиПродукцииВЕТИС/ОстаткиПродукцииВЕТИС.mdo
<?xml version="1.0" encoding="UTF-8"?>
<mdclass:InformationRegister>
  <name>ОстаткиПродукцииВЕТИС</name>
  <resources>
    <name>КоличествоВЕТИС</name>
    <type>
      <types>Number</types>
      <numberQualifiers>
        <precision>15</precision>
        <scale>3</scale>
      </numberQualifiers>
    </type>
  </resources>
  <resources>
    <name>ЕдиницаИзмеренияВЕТИС</name>
    <type>
      <types>CatalogRef.ЕдиницыИзмеренияВЕТИС</types>
    </type>
  </resources>
  <dimensions>
    <name>ХозяйствующийСубъект</name>
    <type>
      <types>CatalogRef.ХозяйствующиеСубъектыВЕТИС</types>
    </type>
  </dimensions>
  <dimensions>
    <name>Предприятие</name>
    <type>
      <types>CatalogRef.ПредприятияВЕТИС</types>
    </type>
  </dimensions>
  <dimensions>
    <name>Продукция</name>
    <type>
      <types>CatalogRef.ПродукцияВЕТИС</types>
    </type>
  </dimensions>
  <dimensions>
    <name>ЗаписьСкладскогоЖурнала</name>
    <type>
      <types>CatalogRef.ЗаписиСкладскогоЖурналаВЕТИС</types>
    </type>
  </dimensions>
</mdclass:InformationRegister>

Podkova/src/Enums/РезультатыЛабораторныхИсследованийВЕТИС/РезультатыЛабораторныхИсследованийВЕТИС.mdo
<?xml version="1.0" encoding="UTF-8"?>
<mdclass:Enum>
  <name>РезультатыЛабораторныхИсследованийВЕТИС</name>
  <enumValues>
    <name>НетДанных</name>
  </enumValues>
  <enumValues>
    <name>Положительный</name>
  </enumValues>
  <enumValues>
    <name>Отрицательный</name>
  </enumValues>
  <enumValues>
    <name>НеПодвергнутаВСЭ</name>
  </enumValues>
  <enumValues>
    <name>ИзготовленаИзСырьяПрошедшегоВСЭ</name>
  </enumValues>
  <enumValues>
    <name>ПодвергнутаВСЭВПолномОбъеме</name>
  </enumValues>
</mdclass:Enum>

Podkova/src/Documents/ИсходящаяТранспортнаяОперацияВЕТИС/ИсходящаяТранспортнаяОперацияВЕТИС.mdo
<?xml version="1.0" encoding="UTF-8"?>
<mdclass:Document>
  <name>ИсходящаяТранспортнаяОперацияВЕТИС</name>
  <registerRecords>AccumulationRegister.ДвиженияСерийТоваров</registerRecords>
  <registerRecords>InformationRegister.ЗаписиСкладскогоЖурналаВРезервеВЕТИС</registerRecords>
  <attributes>
    <name>ДокументОснование</name>
    <type>
      <types>DefinedType.ОснованиеИсходящаяТранспортнаяОперацияВЕТИС</types>
    </type>
  </attributes>
  <attributes>
    <name>Идентификатор</name>
    <type>
      <types>DefinedType.УникальныйИдентификаторИС</types>
    </type>
  </attributes>
  <attributes>
    <name>ГрузоотправительХозяйствующийСубъект</name>
    <type>
      <types>CatalogRef.ХозяйствующиеСубъектыВЕТИС</types>
    </type>
  </attributes>
  <attributes>
    <name>ГрузоотправительПредприятие</name>
    <type>
      <types>CatalogRef.ПредприятияВЕТИС</types>
    </type>
  </attributes>
  <attributes>
    <name>ГрузополучательХозяйствующийСубъект</name>
    <type>
      <types>CatalogRef.ХозяйствующиеСубъектыВЕТИС</types>
    </type>
  </attributes>
  <attributes>
    <name>ГрузополучательПредприятие</name>
    <type>
      <types>CatalogRef.ПредприятияВЕТИС</types>
    </type>
  </attributes>
  <attributes>
    <name>ПеревозчикХозяйствующийСубъект</name>
    <type>
      <types>CatalogRef.ХозяйствующиеСубъектыВЕТИС</types>
    </type>
  </attributes>
  <attributes>
    <name>СпособХранения</name>
    <type>
      <types>EnumRef.СпособыХраненияПриТранспортировкеВЕТИС</types>
    </type>
  </attributes>
  <attributes>
    <name>СерияТТН</name>
    <type>
      <types>DefinedType.СтрокаВЕТИС</types>
    </type>
  </attributes>
  <attributes>
    <name>ДатаТТН</name>
    <type>
      <types>Date</types>
      <dateQualifiers>
        <dateFractions>Date</dateFractions>
      </dateQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>НомерТТН</name>
    <type>
      <types>DefinedType.СтрокаВЕТИС</types>
    </type>
  </attributes>
  <attributes>
    <name>ТипТТН</name>
    <type>
      <types>EnumRef.ТипыДокументовВЕТИС</types>
    </type>
  </attributes>
  <attributes>
    <name>Ответственный</name>
    <type>
      <types>CatalogRef.Пользователи</types>
    </type>
  </attributes>
  <attributes>
    <name>Комментарий</name>
    <type>
      <types>String</types>
    </type>
  </attributes>
  <attributes>
    <name>ТТНУказан</name>
    <type>
      <types>Boolean</types>
    </type>
  </attributes>
  <attributes>
    <name>ТорговыйОбъект</name>
    <type>
      <types>DefinedType.ТорговыйОбъектВЕТИС</types>
    </type>
  </attributes>
  <tabularSections>
    <name>Товары</name>
    <attributes>
      <name>ИдентификаторСтроки</name>
      <type>
        <types>DefinedType.УникальныйИдентификаторИС</types>
      </type>
    </attributes>
    <attributes>
      <name>Номенклатура</name>
      <type>
        <types>DefinedType.Номенклатура</types>
      </type>
    </attributes>
    <attributes>
      <name>Характеристика</name>
      <type>
        <types>DefinedType.ХарактеристикаНоменклатуры</types>
      </type>
    </attributes>
    <attributes>
      <name>Серия</name>
      <type>
        <types>DefinedType.СерияНоменклатурыВЕТИС</types>
      </type>
    </attributes>
    <attributes>
      <name>Продукция</name>
      <type>
        <types>CatalogRef.ПродукцияВЕТИС</types>
      </type>
    </attributes>
    <attributes>
      <name>Количество</name>
      <type>
        <types>Number</types>
        <numberQualifiers>
          <precision>15</precision>
          <scale>3</scale>
        </numberQualifiers>
      </type>
    </attributes>
    <attributes>
      <name>КоличествоВЕТИС</name>
      <type>
        <types>Number</types>
        <numberQualifiers>
          <precision>15</precision>
          <scale>3</scale>
        </numberQualifiers>
      </type>
    </attributes>
    <attributes>
      <name>ЕдиницаИзмеренияВЕТИС</name>
      <type>
        <types>CatalogRef.ЕдиницыИзмеренияВЕТИС</types>
      </type>
    </attributes>
    <attributes>
      <name>БлагополучиеМестности</name>
      <type>
        <types>DefinedType.СтрокаВЕТИС</types>
      </type>
    </attributes>
    <attributes>
      <name>ВетеринарноСопроводительныйДокумент</name>
      <type>
        <types>CatalogRef.ВетеринарноСопроводительныйДокументВЕТИС</types>
      </type>
    </attributes>
    <attributes>
      <name>ЗаписьСкладскогоЖурнала</name>
      <type>
        <types>CatalogRef.ЗаписиСкладскогоЖурналаВЕТИС</types>
      </type>
    </attributes>
    <attributes>
      <name>КоличествоПериодовНахожденияЖивотныхНаТерриторииТС</name>
      <type>
        <types>Number</types>
        <numberQualifiers>
          <precision>3</precision>
        </numberQualifiers>
      </type>
    </attributes>
    <attributes>
      <name>НизкокачественнаяПродукция</name>
      <type>
        <types>Boolean</types>
      </type>
    </attributes>
    <attributes>
      <name>ОсобыеОтметки</name>
      <type>
        <types>DefinedType.СтрокаВЕТИС</types>
      </type>
    </attributes>
    <attributes>
      <name>ПериодНахожденияЖивотныхНаТерриторииТС</name>
      <type>
        <types>EnumRef.ПериодыНахожденияЖивотныхНаТерриторииТСВЕТИС</types>
      </type>
    </attributes>
    <attributes>
      <name>РезультатПроверкиПравилРегионализации</name>
      <type>
        <types>EnumRef.РезультатыПроверкиПравилРегионализации</types>
      </type>
    </attributes>
    <attributes>
      <name>СтатусУказанияСерий</name>
      <type>
        <types>Number</types>
        <numberQualifiers>
          <precision>2</precision>
        </numberQualifiers>
      </type>
    </attributes>
    <attributes>
      <name>УсловияРегионализацииВыполнены</name>
      <comment>Устанавливается, если есть условия регионализации и они выполнены</comment>
      <type>
        <types>Boolean</types>
      </type>
    </attributes>
    <attributes>
      <name>Цель</name>
      <type>
        <types>CatalogRef.ЦелиВЕТИС</types>
      </type>
    </attributes>
    <attributes>
      <name>ЭкспертизаРезультат</name>
      <type>
        <types>EnumRef.РезультатыЛабораторныхИсследованийВЕТИС</types>
      </type>
    </attributes>
    <attributes>
      <name>ТипПроисхождения</name>
      <type>
        <types>EnumRef.ТипыПроисхожденияНепищевойПродукцииВЕТИС</types>
      </type>
    </attributes>
    <attributes>
      <name>МестоДляКарантинирования</name>
      <type>
        <types>DefinedType.СтрокаВЕТИС</types>
      </type>
    </attributes>
    <attributes>
      <name>КоличествоДнейДляКарантинирования</name>
      <type>
        <types>Number</types>
        <numberQualifiers>
          <precision>3</precision>
        </numberQualifiers>
      </type>
    </attributes>
    <attributes>
      <name>ДатаПроизводстваСтрока</name>
      <type>
        <types>DefinedType.СтрокаВЕТИС</types>
      </type>
    </attributes>
    <attributes>
      <name>ДатаПроизводстваТочностьЗаполнения</name>
      <type>
        <types>EnumRef.ТочностьЗаполненияПериодаВЕТИС</types>
      </type>
    </attributes>
    <attributes>
      <name>ДатаПроизводстваНачалоПериода</name>
      <type>
        <types>Date</types>
      </type>
    </attributes>
    <attributes>
      <name>ДатаПроизводстваКонецПериода</name>
      <type>
        <types>Date</types>
      </type>
    </attributes>
    <attributes>
      <name>СрокГодностиСтрока</name>
      <type>
        <types>DefinedType.СтрокаВЕТИС</types>
      </type>
    </attributes>
    <attributes>
      <name>СрокГодностиТочностьЗаполнения</name>
      <type>
        <types>EnumRef.ТочностьЗаполненияПериодаВЕТИС</types>
      </type>
    </attributes>
    <attributes>
      <name>СрокГодностиНачалоПериода</name>
      <type>
        <types>Date</types>
      </type>
    </attributes>
    <attributes>
      <name>СрокГодностиКонецПериода</name>
      <type>
        <types>Date</types>
      </type>
    </attributes>
    <attributes>
      <name>СкоропортящаясяПродукция</name>
      <type>
        <types>Boolean</types>
      </type>
    </attributes>
  </tabularSections>
  <tabularSections>
    <name>УпаковкиВЕТИС</name>
    <attributes>
      <name>ИдентификаторСтрокиТовары</name>
      <type>
        <types>DefinedType.УникальныйИдентификаторИС</types>
      </type>
    </attributes>
    <attributes>
      <name>ИдентификаторСтроки</name>
      <type>
        <types>DefinedType.УникальныйИдентификаторИС</types>
      </type>
    </attributes>
    <attributes>
      <name>УровеньУпаковки</name>
      <type>
        <types>EnumRef.УровниУпаковокВЕТИС</types>
      </type>
    </attributes>
    <attributes>
      <name>УпаковкаВЕТИС</name>
      <type>
        <types>CatalogRef.УпаковкиВЕТИС</types>
      </type>
    </attributes>
    <attributes>
      <name>КоличествоУпаковокВЕТИС</name>
      <type>
        <types>Number</types>
        <numberQualifiers>
          <precision>15</precision>
        </numberQualifiers>
      </type>
    </attributes>
  </tabularSections>
  <tabularSections>
    <name>ШтрихкодыУпаковок</name>
    <attributes>
      <name>ИдентификаторСтроки</name>
      <type>
        <types>DefinedType.УникальныйИдентификаторИС</types>
      </type>
    </attributes>
    <attributes>
      <name>Штрихкод</name>
      <type>
        <types>DefinedType.СтрокаВЕТИС</types>
      </type>
    </attributes>
    <attributes>
      <name>ТипМаркировки</name>
      <type>
        <types>EnumRef.ТипыМаркировкиУпаковокВЕТИС</types>
      </type>
    </attributes>
  </tabularSections>
  <tabularSections>
    <name>Маршрут</name>
    <attributes>
      <name>Идентификатор</name>
      <type>
        <types>DefinedType.УникальныйИдентификаторИС</types>
      </type>
    </attributes>
    <attributes>
      <name>Предприятие</name>
      <type>
        <types>CatalogRef.ПредприятияВЕТИС</types>
      </type>
    </attributes>
    <attributes>
      <name>Адрес</name>
      <type>
        <types>String</types>
      </type>
    </attributes>
    <attributes>
      <name>АдресПредставление</name>
      <type>
        <types>String</types>
      </type>
    </attributes>
    <attributes>
      <name>СПерегрузкой</name>
      <type>
        <types>Boolean</types>
      </type>
    </attributes>
    <attributes>
      <name>ДанныеАдреса</name>
      <type>
        <types>ValueStorage</types>
      </type>
    </attributes>
    <attributes>
      <name>ТипТранспорта</name>
      <type>
        <types>EnumRef.ТипыТранспортаВЕТИС</types>
      </type>
    </attributes>
    <attributes>
      <name>ТранспортноеСредство</name>
      <type>
        <types>DefinedType.ТранспортныеСредстваВЕТИС</types>
      </type>
    </attributes>
    <attributes>
      <name>НомерТранспортногоСредства</name>
      <type>
        <types>DefinedType.СтрокаВЕТИС</types>
      </type>
    </attributes>
    <attributes>
      <name>НомерАвтомобильногоПрицепа</name>
      <type>
        <types>DefinedType.СтрокаВЕТИС</types>
      </type>
    </attributes>
    <attributes>
      <name>НомерАвтомобильногоКонтейнера</name>
      <type>
        <types>DefinedType.СтрокаВЕТИС</types>
      </type>
    </attributes>
    <attributes>
      <name>РезультатПроверкиПравилРегионализации</name>
      <type>
        <types>EnumRef.РезультатыПроверкиПравилРегионализации</types>
      </type>
    </attributes>
    <attributes>
      <name>УсловияРегионализацииВыполнены</name>
      <comment>Устанавливается, если есть условия регионализации и они выполнены</comment>
      <type>
        <types>Boolean</types>
      </type>
    </attributes>
  </tabularSections>
  <tabularSections>
    <name>Регионализация</name>
    <attributes>
      <name>ВидПродукции</name>
      <type>
        <types>CatalogRef.ПродукцияВЕТИС</types>
      </type>
    </attributes>
    <attributes>
      <name>УсловиеРегионализации</name>
      <type>
        <types>CatalogRef.УсловияРегионализацииВЕТИС</types>
      </type>
    </attributes>
    <attributes>
      <name>УсловиеВыполняется</name>
      <type>
        <types>Boolean</types>
      </type>
    </attributes>
  </tabularSections>
  <tabularSections>
    <name>СвязанныеДокументы</name>
    <attributes>
      <name>ТипДокумента</name>
      <type>
        <types>EnumRef.ТипыДокументовВЕТИС</types>
      </type>
    </attributes>
    <attributes>
      <name>Серия</name>
      <type>
        <types>DefinedType.СтрокаВЕТИС</types>
      </type>
    </attributes>
    <attributes>
      <name>Номер</name>
      <type>
        <types>DefinedType.СтрокаВЕТИС</types>
      </type>
    </attributes>
    <attributes>
      <name>Дата</name>
      <type>
        <types>Date</types>
        <dateQualifiers>
          <dateFractions>Date</dateFractions>
        </dateQualifiers>
      </type>
    </attributes>
  </tabularSections>
</mdclass:Document>

Podkova/src/CommonModules/ЗаполнениеОбъектовПоСтатистикеВЕТИС/Module.bsl
#Область ПрограммныйИнтерфейс

// Получает историю поля "Благополучие местности" по предыдущим трем документам "Исходящая транспортная операция ВетИС"
//   * Массив с элементом "Местность благополучна по заразным болезням животных", если не было документов
//   * Массив значений заполнения в иных случаях
// 
// Параметры:
//   Предприятие - СправочникСсылка.ПредприятияВЕТИС - грузоотправитель
// Возвращаемое значение:
//   Массив Из Строка - значения заполнения поля "Благополучие местности" в исходящей транспортной операции ВетИС
//     по предыдущим документам площадки
//
Функция БлагополучиеМестностиПоПредприятию(Предприятие) Экспорт
	
	Запрос = Новый Запрос;
	Запрос.УстановитьПараметр("Предприятие", Предприятие);
	Запрос.Текст = 
	"ВЫБРАТЬ ПЕРВЫЕ 3
	|	ИсходящаяТранспортнаяОперацияВЕТИС.Ссылка КАК Ссылка
	|ПОМЕСТИТЬ Документы
	|ИЗ
	|	Документ.ИсходящаяТранспортнаяОперацияВЕТИС КАК ИсходящаяТранспортнаяОперацияВЕТИС
	|ГДЕ
	|	ИсходящаяТранспортнаяОперацияВЕТИС.Проведен
	|	И ИсходящаяТранспортнаяОперацияВЕТИС.ГрузоотправительПредприятие = &Предприятие
	|УПОРЯДОЧИТЬ ПО
	|	ИсходящаяТранспортнаяОперацияВЕТИС.Дата Убыв
	|;
	|////////////////////////////////////////////////////////////////////////////////
	|ВЫБРАТЬ
	|	ИсходящаяТранспортнаяОперацияВЕТИСТовары.БлагополучиеМестности             КАК БлагополучиеМестности,
	|	КОЛИЧЕСТВО(ИсходящаяТранспортнаяОперацияВЕТИСТовары.БлагополучиеМестности) КАК КоличествоВхождений
	|ИЗ
	|	Документы КАК Документы
	|		ВНУТРЕННЕЕ СОЕДИНЕНИЕ Документ.ИсходящаяТранспортнаяОперацияВЕТИС.Товары КАК
	|			ИсходящаяТранспортнаяОперацияВЕТИСТовары
	|		ПО Документы.Ссылка = ИсходящаяТранспортнаяОперацияВЕТИСТовары.Ссылка
	|СГРУППИРОВАТЬ ПО
	|	ИсходящаяТранспортнаяОперацияВЕТИСТовары.БлагополучиеМестности
	|УПОРЯДОЧИТЬ ПО
	|	КоличествоВхождений Убыв";
	
	Выборка = Запрос.Выполнить().Выбрать();
	
	Результат = Новый Массив;
	Пока Выборка.Следующий() Цикл
		Результат.Добавить(Выборка.БлагополучиеМестности);
	КонецЦикла;
	
	Если Результат.Количество() = 0 Тогда
		Результат.Добавить(НСтр("ru='Местность благополучна по заразным болезням животных'"));
	КонецЕсли;
	
	Возврат Результат;
	
КонецФункции

// Получает историю поля "Цель" по предыдущим документам "Исходящая транспортная операция ВетИС" на текущего получателя 
//   по группе продукции. Ограничивает доступной продукцией.
// 
// Параметры:
//   Продукция                  - СправочникСсылка.ПродукцияВЕТИС             - продукция
//   НизкокачественнаяПродукция - Булево, Неопределено                        - признак низкокачественной продукции
//   ХозяйствующийСубъект       - СправочникСсылка.ХозяйствующиеСубъектыВЕТИС - грузополучатель
//   КешированныеЗначения       - ДеревоЗначений, Неопределено                - кешированные значения допустимых целей
//
// Возвращаемое значение:
//   Массив Из СправочникСсылка.ЦелиВЕТИС - значения заполнения поля "Цель" в исходящей транспортной операции ВетИС
//     по предыдущим документам грузополучателя (либо все доступные цели)
//
Функция ЦелиПоПродукцииИПолучателю(Продукция, НизкокачественнаяПродукция, ХозяйствующийСубъект, КешированныеЗначения) Экспорт
	
	ДоступныеЦели = ДопустимыеЦелиВЕТИС.ДопустимыеЦелиПоПродукции(Продукция, КешированныеЗначения, НизкокачественнаяПродукция);
	
	Запрос = Новый Запрос;
	Запрос.УстановитьПараметр("Продукция",            Продукция);
	Запрос.УстановитьПараметр("ХозяйствующийСубъект", ХозяйствующийСубъект);
	Запрос.УстановитьПараметр("ДоступныеЦели",        ДоступныеЦели);
	Запрос.Текст = 
	"ВЫБРАТЬ
	|	ПродукцияВЕТИС.Родитель КАК Родитель
	|ПОМЕСТИТЬ Группа
	|ИЗ
	|	Справочник.ПродукцияВЕТИС КАК ПродукцияВЕТИС
	|ГДЕ
	|	ПродукцияВЕТИС.Ссылка = &Продукция
	|;
	|////////////////////////////////////////////////////////////////////////////////
	|ВЫБРАТЬ РАЗЛИЧНЫЕ ПЕРВЫЕ 3
	|	ТоварыДокумента.Ссылка      КАК Ссылка,
	|	ТоварыДокумента.Ссылка.Дата КАК Дата
	|ПОМЕСТИТЬ Документы
	|ИЗ
	|	Документ.ИсходящаяТранспортнаяОперацияВЕТИС.Товары КАК ТоварыДокумента
	|		ВНУТРЕННЕЕ СОЕДИНЕНИЕ Группа КАК Группа
	|		ПО ТоварыДокумента.Продукция.Родитель = Группа.Родитель
	|ГДЕ
	|	ТоварыДокумента.Ссылка.ГрузополучательХозяйствующийСубъект = &ХозяйствующийСубъект
	|	И ТоварыДокумента.Ссылка.Проведен
	|	И ТоварыДокумента.Цель В (&ДоступныеЦели)
	|УПОРЯДОЧИТЬ ПО
	|	Дата Убыв
	|;
	|////////////////////////////////////////////////////////////////////////////////
	|ВЫБРАТЬ
	|	ИсходящаяТранспортнаяОперацияВЕТИСТовары.Цель КАК Цель,
	|	КОЛИЧЕСТВО(ИсходящаяТранспортнаяОперацияВЕТИСТовары.Цель) КАК КоличествоВхождений
	|ИЗ
	|	Документы КАК Документы
	|		ВНУТРЕННЕЕ СОЕДИНЕНИЕ Документ.ИсходящаяТранспортнаяОперацияВЕТИС.Товары КАК
	|			ИсходящаяТранспортнаяОперацияВЕТИСТовары
	|		ПО Документы.Ссылка = ИсходящаяТранспортнаяОперацияВЕТИСТовары.Ссылка
	|		ВНУТРЕННЕЕ СОЕДИНЕНИЕ Группа КАК Группа
	|		ПО ИсходящаяТранспортнаяОперацияВЕТИСТовары.Продукция.Родитель = Группа.Родитель
	|СГРУППИРОВАТЬ ПО
	|	ИсходящаяТранспортнаяОперацияВЕТИСТовары.Цель
	|УПОРЯДОЧИТЬ ПО
	|	КоличествоВхождений Убыв";
	
	Выборка = Запрос.Выполнить().Выбрать();
	
	Результат = Новый Массив;
	Пока Выборка.Следующий() Цикл
		Результат.Добавить(Выборка.Цель);
	КонецЦикла;
	
	Если Результат.Количество() = 0 Тогда
		Результат = ДоступныеЦели;
	КонецЕсли;
	
	Возврат Результат;
	
КонецФункции

// Получает историю поля "Скоропортящаяся продукция" по предыдущим документам "Производственная операция ВетИС"
//   по текущей продукции
//
// Параметры:
//   Продукция - Массив Из СправочникСсылка.ПродукцияВЕТИС - продукция
//
// Возвращаемое значение:
//   Массив Из СправочникСсылка.ПродукцияВЕТИС - скоропортящаяся продукции
//
Функция СкоропортящаясяПродукцияПоПродукции(Продукция) Экспорт
	
	Запрос = Новый Запрос;
	Запрос.УстановитьПараметр("Продукция", Продукция);
	Запрос.Текст = 
	"ВЫБРАТЬ
	|	ТоварыДокумента.Продукция             КАК Продукция,
	|	МАКСИМУМ(ТоварыДокумента.Ссылка.Дата) КАК Дата
	|ПОМЕСТИТЬ Документы
	|ИЗ
	|	Документ.ПроизводственнаяОперацияВЕТИС.Товары КАК ТоварыДокумента
	|ГДЕ
	|	ТоварыДокумента.Продукция В (&Продукция)
	|	И ТоварыДокумента.Ссылка.Проведен
	|СГРУППИРОВАТЬ ПО
	|	ТоварыДокумента.Продукция
	|;
	|////////////////////////////////////////////////////////////////////////////////
	|ВЫБРАТЬ
	|	Документы.Продукция КАК Продукция
	|ИЗ
	|	Документы КАК Документы
	|		ВНУТРЕННЕЕ СОЕДИНЕНИЕ Документ.ПроизводственнаяОперацияВЕТИС.Товары КАК ТоварыДокумента
	|		ПО Документы.Дата = ТоварыДокумента.Ссылка.Дата
	|		И ТоварыДокумента.Ссылка.Проведен
	|		И Документы.Продукция = ТоварыДокумента.Продукция
	|		И ТоварыДокумента.СкоропортящаясяПродукция
	|СГРУППИРОВАТЬ ПО
	|	Документы.Продукция";
	
	Возврат Запрос.Выполнить().Выгрузить().ВыгрузитьКолонку("Продукция");
	
КонецФункции

// Получает историю полей "Экспертиза выполнена", "Ветеринарно-санитарная экспертиза" по предыдущим документам 
//   "Производственная операция ВетИС" по текущему пользователю
//
// Возвращаемое значение:
//   Структура, Неопределено - значения полей "ЭкспертизаВыполнена" и "ЭкспертизаРезультат" если они совпали 
//     в предыдущих документах
//
Функция ЭкспертизаПоПользователю() Экспорт
	
	Запрос = Новый Запрос;
	Запрос.УстановитьПараметр("Ответственный", Пользователи.ТекущийПользователь());
	
	Запрос.Текст = 
	"ВЫБРАТЬ ПЕРВЫЕ 3
	|	Документы.Ссылка КАК Ссылка
	|ПОМЕСТИТЬ Документы
	|ИЗ
	|	Документ.ПроизводственнаяОперацияВЕТИС КАК Документы
	|ГДЕ
	|	Документы.Проведен
	|	И Документы.Ответственный = &Ответственный
	|УПОРЯДОЧИТЬ ПО
	|	Документы.Дата Убыв
	|;
	|
	|////////////////////////////////////////////////////////////////////////////////
	|ВЫБРАТЬ РАЗЛИЧНЫЕ
	|	ТоварыДокумента.ЭкспертизаРезультат КАК ЭкспертизаРезультат,
	|	ТоварыДокумента.ЭкспертизаВыполнена КАК ЭкспертизаВыполнена
	|ИЗ
	|	Документы КАК Документы
	|		ВНУТРЕННЕЕ СОЕДИНЕНИЕ Документ.ПроизводственнаяОперацияВЕТИС.Товары КАК ТоварыДокумента
	|		ПО Документы.Ссылка = ТоварыДокумента.Ссылка";
	
	Выборка = Запрос.Выполнить().Выбрать();
	
	Результат = Новый Структура(
		"ЭкспертизаВыполнена, ЭкспертизаРезультат", Ложь, Перечисления.РезультатыЛабораторныхИсследованийВЕТИС.НеПодвергнутаВСЭ);
	
	Если Выборка.Количество() = 1 Тогда
		Если Выборка.Следующий() Тогда
			Если ЗначениеЗаполнено(Выборка.ЭкспертизаРезультат) Тогда
				Результат.ЭкспертизаРезультат = Выборка.ЭкспертизаРезультат;
			КонецЕсли;
			Результат.ЭкспертизаВыполнена = Выборка.ЭкспертизаВыполнена;
		КонецЕсли;
	КонецЕсли;
	
	Возврат Результат;
	
КонецФункции

// Получает срок годности продукции по предыдущим документам "Производственная операция ВетИС"
//
// Параметры:
//   Продукция - Массив Из СправочникСсылка.ПродукцияВЕТИС - продукция
//
// Возвращаемое значение:
//   Соответствие - сроки годности продукции по предыдущим документам:
//    * Ключ     - СправочникСсылка.ПродукцияВЕТИС - продукция
//    * Значение - Структура - точности заполнения даты производства и срока годности, срок годности в часах
//
Функция СрокГодностиПоПродукции(Продукция) Экспорт
	
	Запрос = Новый Запрос;
	Запрос.УстановитьПараметр("Продукция", Продукция);
	Запрос.Текст = 
	"ВЫБРАТЬ
	|	ТоварыДокумента.Продукция КАК Продукция,
	|	МАКСИМУМ(ТоварыДокумента.Ссылка.Дата) КАК Дата
	|ПОМЕСТИТЬ Документы
	|ИЗ
	|	Документ.ПроизводственнаяОперацияВЕТИС.Товары КАК ТоварыДокумента
	|ГДЕ
	|	ТоварыДокумента.Продукция В (&Продукция)
	|	И ТоварыДокумента.Ссылка.Проведен
	|СГРУППИРОВАТЬ ПО
	|	ТоварыДокумента.Продукция
	|;
	|////////////////////////////////////////////////////////////////////////////////
	|ВЫБРАТЬ
	|	ТоварыДокумента.Продукция КАК Продукция,
	|	МАКСИМУМ(ТоварыДокумента.СрокГодностиТочностьЗаполнения) КАК СрокГодностиТочностьЗаполнения,
	|	МАКСИМУМ(ТоварыДокумента.ДатаПроизводстваТочностьЗаполнения) КАК ДатаПроизводстваТочностьЗаполнения,
	|	МАКСИМУМ(ВЫБОР
	|		КОГДА ТоварыДокумента.СрокГодностиНачалоПериода = ДАТАВРЕМЯ(1,1,1)
	|			ТОГДА 0
	|		КОГДА ТоварыДокумента.ДатаПроизводстваНачалоПериода = ДАТАВРЕМЯ(1,1,1)
	|			ТОГДА 0
	|		ИНАЧЕ РАЗНОСТЬДАТ(ТоварыДокумента.ДатаПроизводстваНачалоПериода, ТоварыДокумента.СрокГодностиНачалоПериода, ЧАС)
	|	КОНЕЦ) КАК СрокГодности
	|ИЗ
	|	Документы КАК Документы
	|		ВНУТРЕННЕЕ СОЕДИНЕНИЕ Документ.ПроизводственнаяОперацияВЕТИС.Товары КАК ТоварыДокумента
	|		ПО Документы.Дата = ТоварыДокумента.Ссылка.Дата
	|		И ТоварыДокумента.Ссылка.Проведен
	|		И Документы.Продукция = ТоварыДокумента.Продукция
	|СГРУППИРОВАТЬ ПО
	|	ТоварыДокумента.Продукция";
	
	Результат = Новый Соответствие;
	Выборка = Запрос.Выполнить().Выбрать();
	Пока Выборка.Следующий() Цикл
		Если Выборка.СрокГодности > 0 Тогда
			Результат.Вставить(Выборка.Продукция,
				Новый Структура("СрокГодностиТочностьЗаполнения, ДатаПроизводстваТочностьЗаполнения, СрокГодности",
					Выборка.СрокГодностиТочностьЗаполнения,
					Выборка.ДатаПроизводстваТочностьЗаполнения,
					Выборка.СрокГодности));
		КонецЕсли;
	КонецЦикла;
	
	Возврат Результат;
	
КонецФункции

// Получает срок годности продукции по журналу продукции ВетИС
//
// Параметры:
//   Продукция - Массив Из СправочникСсылка.ПродукцияВЕТИС - продукция
//
// Возвращаемое значение:
//   Соответствие - сроки годности продукции по предыдущим документам:
//    * Ключ     - СправочникСсылка.ПродукцияВЕТИС - продукция
//    * Значение - Структура - точности заполнения даты производства и срока годности, срок годности в часах
//
Функция СрокГодностиПоЗаписиЖурнала(Продукция) Экспорт
	
	Запрос = Новый Запрос;
	Запрос.УстановитьПараметр("Продукция", Продукция);
	Запрос.Текст = 
	"ВЫБРАТЬ
	|	ОстаткиПродукцииВЕТИС.Продукция КАК Продукция,
	|	ОстаткиПродукцииВЕТИС.ЗаписьСкладскогоЖурнала КАК ЗаписьСкладскогоЖурнала
	|ПОМЕСТИТЬ АктуальныеЗаписи
	|ИЗ
	|	РегистрСведений.ОстаткиПродукцииВЕТИС КАК ОстаткиПродукцииВЕТИС
	|ГДЕ
	|	ОстаткиПродукцииВЕТИС.Продукция В (&Продукция)
	|СГРУППИРОВАТЬ ПО
	|	ОстаткиПродукцииВЕТИС.Продукция,
	|	ОстаткиПродукцииВЕТИС.ЗаписьСкладскогоЖурнала
	|;
	|
	|////////////////////////////////////////////////////////////////////////////////
	|ВЫБРАТЬ
	|	АктуальныеЗаписи.Продукция КАК Продукция,
	|	МАКСИМУМ(ЗаписиСкладскогоЖурналаВЕТИС.СрокГодностиТочностьЗаполнения) КАК СрокГодностиТочностьЗаполнения,
	|	МАКСИМУМ(ЗаписиСкладскогоЖурналаВЕТИС.ДатаПроизводстваТочностьЗаполнения) КАК ДатаПроизводстваТочностьЗаполнения,
	|	МАКСИМУМ(ВЫБОР
	|		КОГДА ЗаписиСкладскогоЖурналаВЕТИС.СрокГодностиНачалоПериода = ДАТАВРЕМЯ(1, 1, 1)
	|			ТОГДА 0
	|		КОГДА ЗаписиСкладскогоЖурналаВЕТИС.ДатаПроизводстваНачалоПериода = ДАТАВРЕМЯ(1, 1, 1)
	|			ТОГДА 0
	|		ИНАЧЕ РАЗНОСТЬДАТ(ЗаписиСкладскогоЖурналаВЕТИС.ДатаПроизводстваНачалоПериода,
	|			ЗаписиСкладскогоЖурналаВЕТИС.СрокГодностиНачалоПериода, ЧАС)
	|	КОНЕЦ) КАК СрокГодности
	|ИЗ
	|	АктуальныеЗаписи КАК АктуальныеЗаписи
	|		ВНУТРЕННЕЕ СОЕДИНЕНИЕ Справочник.ЗаписиСкладскогоЖурналаВЕТИС КАК ЗаписиСкладскогоЖурналаВЕТИС
	|		ПО ЗаписиСкладскогоЖурналаВЕТИС.Ссылка = АктуальныеЗаписи.ЗаписьСкладскогоЖурнала
	|СГРУППИРОВАТЬ ПО
	|	АктуальныеЗаписи.Продукция
	|ИМЕЮЩИЕ
	|	КОЛИЧЕСТВО(РАЗЛИЧНЫЕ ЗаписиСкладскогоЖурналаВЕТИС.СрокГодностиТочностьЗаполнения) = 1
	|	И КОЛИЧЕСТВО(РАЗЛИЧНЫЕ ВЫБОР
	|		КОГДА ЗаписиСкладскогоЖурналаВЕТИС.СрокГодностиНачалоПериода = ДАТАВРЕМЯ(1, 1, 1)
	|			ТОГДА 0
	|		КОГДА ЗаписиСкладскогоЖурналаВЕТИС.ДатаПроизводстваНачалоПериода = ДАТАВРЕМЯ(1, 1, 1)
	|			ТОГДА 0
	|		ИНАЧЕ РАЗНОСТЬДАТ(ЗаписиСкладскогоЖурналаВЕТИС.ДатаПроизводстваНачалоПериода,
	|			ЗаписиСкладскогоЖурналаВЕТИС.СрокГодностиНачалоПериода, ЧАС)
	|	КОНЕЦ) = 1";
	
	Результат = Новый Соответствие;
	Выборка = Запрос.Выполнить().Выбрать();
	Пока Выборка.Следующий() Цикл
		Если Выборка.СрокГодности > 0 Тогда
			Результат.Вставить(Выборка.Продукция, 
				Новый Структура("СрокГодности, ДатаПроизводстваТочностьЗаполнения, СрокГодностиТочностьЗаполнения",
					Выборка.СрокГодности,
					Выборка.ДатаПроизводстваТочностьЗаполнения,
					Выборка.СрокГодностиТочностьЗаполнения));
		КонецЕсли;
	КонецЦикла;
	
	Возврат Результат;
	
КонецФункции

// Получает перевозчика и способ хранения при перевозке по реквизитам транспортного средства
//   (при полном совпадении реквизитов с одной из предыдущих перевозок, последней по дате если их несколько)
//
// Параметры:
//   РеквизитыТранспортногоСредства - Структура - реквизиты транспортного средства маршрута:
//     * ТипТранспорта - ПеречислениеСсылка.ТипыТранспортаВЕТИС,
//     * ТранспортноеСредство - ОпределяемыйТип.ТранспортныеСредстваВЕТИС,
//     * НомерТранспортногоСредства - ОпределяемыйТип.СтрокаВЕТИС,
//     * НомерАвтомобильногоПрицепа - ОпределяемыйТип.СтрокаВЕТИС,
//     * НомерАвтомобильногоКонтейнера - ОпределяемыйТип.СтрокаВЕТИС.
//
// Возвращаемое значение:
//   Структура - перевозчик и способ хранения:
//    * СпособХранения     - ПеречислениеСсылка.СпособыХраненияПриТранспортировкеВЕТИС,
//    * ПеревозчикХозяйствующийСубъект - СправочникСсылка.ХозяйствующиеСубъектыВЕТИС.
//
Функция РеквизитыПеревозкиПоТранспортномуСредству(РеквизитыТранспортногоСредства) Экспорт
	
	Результат = Новый Структура;
	Результат.Вставить("СпособХранения");
	Результат.Вставить("ПеревозчикХозяйствующийСубъект");
	
	Запрос = Новый Запрос;
	Запрос.УстановитьПараметр("ТипТранспорта",                 РеквизитыТранспортногоСредства.ТипТранспорта);
	Запрос.УстановитьПараметр("ТранспортноеСредство",          РеквизитыТранспортногоСредства.ТранспортноеСредство);
	Запрос.УстановитьПараметр("НомерТранспортногоСредства",    РеквизитыТранспортногоСредства.НомерТранспортногоСредства);
	Запрос.УстановитьПараметр("НомерАвтомобильногоПрицепа",    РеквизитыТранспортногоСредства.НомерАвтомобильногоПрицепа);
	Запрос.УстановитьПараметр("НомерАвтомобильногоКонтейнера", РеквизитыТранспортногоСредства.НомерАвтомобильногоКонтейнера);
	Запрос.Текст = 
	"ВЫБРАТЬ
	|	МАКСИМУМ(ИсходящаяТранспортнаяОперацияВЕТИСМаршрут.Ссылка.Дата) КАК Дата,
	|	1 КАК ВариантПоиска
	|ПОМЕСТИТЬ ДатыПеревозки
	|ИЗ
	|	Документ.ИсходящаяТранспортнаяОперацияВЕТИС.Маршрут КАК ИсходящаяТранспортнаяОперацияВЕТИСМаршрут
	|ГДЕ
	|	ИсходящаяТранспортнаяОперацияВЕТИСМаршрут.ТипТранспорта = &ТипТранспорта
	|	И ИсходящаяТранспортнаяОперацияВЕТИСМаршрут.ТранспортноеСредство = &ТранспортноеСредство
	|	И ИсходящаяТранспортнаяОперацияВЕТИСМаршрут.НомерТранспортногоСредства = &НомерТранспортногоСредства
	|	И ИсходящаяТранспортнаяОперацияВЕТИСМаршрут.НомерАвтомобильногоПрицепа = &НомерАвтомобильногоПрицепа
	|	И ИсходящаяТранспортнаяОперацияВЕТИСМаршрут.НомерАвтомобильногоКонтейнера = &НомерАвтомобильногоКонтейнера
	|	И ИсходящаяТранспортнаяОперацияВЕТИСМаршрут.Ссылка.Проведен
	|
	|ОБЪЕДИНИТЬ ВСЕ
	|
	|ВЫБРАТЬ
	|	МАКСИМУМ(ВходящаяТранспортнаяОперацияВЕТИСМаршрутВозврата.Ссылка.Дата),
	|	2
	|ИЗ
	|	Документ.ВходящаяТранспортнаяОперацияВЕТИС.МаршрутВозврата КАК ВходящаяТранспортнаяОперацияВЕТИСМаршрутВозврата
	|ГДЕ
	|	ВходящаяТранспортнаяОперацияВЕТИСМаршрутВозврата.ТипТранспорта = &ТипТранспорта
	|	И ВходящаяТранспортнаяОперацияВЕТИСМаршрутВозврата.НомерТранспортногоСредства = &НомерТранспортногоСредства
	|	И ВходящаяТранспортнаяОперацияВЕТИСМаршрутВозврата.НомерАвтомобильногоПрицепа = &НомерАвтомобильногоПрицепа
	|	И ВходящаяТранспортнаяОперацияВЕТИСМаршрутВозврата.НомерАвтомобильногоКонтейнера = &НомерАвтомобильногоКонтейнера
	|	И ВходящаяТранспортнаяОперацияВЕТИСМаршрутВозврата.Ссылка.Проведен
	|
	|ОБЪЕДИНИТЬ ВСЕ
	|
	|ВЫБРАТЬ
	|	МАКСИМУМ(ВходящаяТранспортнаяОперацияВЕТИСМаршрут.Ссылка.Дата),
	|	3
	|ИЗ
	|	Документ.ВходящаяТранспортнаяОперацияВЕТИС.Маршрут КАК ВходящаяТранспортнаяОперацияВЕТИСМаршрут
	|ГДЕ
	|	ВходящаяТранспортнаяОперацияВЕТИСМаршрут.ТипТранспорта = &ТипТранспорта
	|	И ВходящаяТранспортнаяОперацияВЕТИСМаршрут.НомерТранспортногоСредства = &НомерТранспортногоСредства
	|	И ВходящаяТранспортнаяОперацияВЕТИСМаршрут.НомерАвтомобильногоПрицепа = &НомерАвтомобильногоПрицепа
	|	И ВходящаяТранспортнаяОперацияВЕТИСМаршрут.НомерАвтомобильногоКонтейнера = &НомерАвтомобильногоКонтейнера
	|	И ВходящаяТранспортнаяОперацияВЕТИСМаршрут.Ссылка.Проведен
	|
	|ОБЪЕДИНИТЬ ВСЕ
	|
	|ВЫБРАТЬ
	|	МАКСИМУМ(ВходящаяТранспортнаяОперацияВЕТИС.Дата),
	|	4
	|ИЗ
	|	Документ.ВходящаяТранспортнаяОперацияВЕТИС КАК ВходящаяТранспортнаяОперацияВЕТИС
	|ГДЕ
	|	ВходящаяТранспортнаяОперацияВЕТИС.ТипТранспорта = &ТипТранспорта
	|	И ВходящаяТранспортнаяОперацияВЕТИС.НомерТранспортногоСредства = &НомерТранспортногоСредства
	|	И ВходящаяТранспортнаяОперацияВЕТИС.НомерАвтомобильногоПрицепа = &НомерАвтомобильногоПрицепа
	|	И ВходящаяТранспортнаяОперацияВЕТИС.НомерАвтомобильногоКонтейнера = &НомерАвтомобильногоКонтейнера
	|	И ВходящаяТранспортнаяОперацияВЕТИС.Проведен
	|;
	|
	|////////////////////////////////////////////////////////////////////////////////
	|ВЫБРАТЬ
	|	МАКСИМУМ(ДатыПеревозки.Дата) КАК Дата
	|ПОМЕСТИТЬ МаксимальнаяДатаПеревозки
	|ИЗ
	|	ДатыПеревозки КАК ДатыПеревозки
	|;
	|
	|////////////////////////////////////////////////////////////////////////////////
	|ВЫБРАТЬ
	|	ДатыПеревозки.Дата,
	|	МИНИМУМ(ДатыПеревозки.ВариантПоиска) КАК ВариантПоиска
	|ПОМЕСТИТЬ ПредыдущаяПеревозка
	|ИЗ
	|	МаксимальнаяДатаПеревозки КАК МаксимальнаяДатаПеревозки
	|		ЛЕВОЕ СОЕДИНЕНИЕ ДатыПеревозки КАК ДатыПеревозки
	|		ПО ДатыПеревозки.Дата = МаксимальнаяДатаПеревозки.Дата
	|СГРУППИРОВАТЬ ПО
	|	ДатыПеревозки.Дата
	|;
	|
	|////////////////////////////////////////////////////////////////////////////////
	|ВЫБРАТЬ
	|	Маршрут.Ссылка.СпособХранения КАК СпособХранения,
	|	Маршрут.Ссылка.ПеревозчикХозяйствующийСубъект КАК ПеревозчикХозяйствующийСубъект
	|ИЗ
	|	ПредыдущаяПеревозка КАК ПредыдущаяПеревозка
	|		ВНУТРЕННЕЕ СОЕДИНЕНИЕ Документ.ИсходящаяТранспортнаяОперацияВЕТИС.Маршрут КАК Маршрут
	|		ПО ПредыдущаяПеревозка.ВариантПоиска = 1
	|		И ПредыдущаяПеревозка.Дата = Маршрут.Ссылка.Дата
	|		И Маршрут.ТипТранспорта = &ТипТранспорта
	|		И Маршрут.ТранспортноеСредство = &ТранспортноеСредство
	|		И Маршрут.НомерТранспортногоСредства = &НомерТранспортногоСредства
	|		И Маршрут.НомерАвтомобильногоПрицепа = &НомерАвтомобильногоПрицепа
	|		И Маршрут.НомерАвтомобильногоКонтейнера = &НомерАвтомобильногоКонтейнера
	|		И Маршрут.Ссылка.Проведен
	|
	|ОБЪЕДИНИТЬ ВСЕ
	|
	|ВЫБРАТЬ
	|	Маршрут.Ссылка.СпособХранения,
	|	Маршрут.Ссылка.ПеревозчикХозяйствующийСубъект
	|ИЗ
	|	ПредыдущаяПеревозка КАК ПредыдущаяПеревозка
	|		ВНУТРЕННЕЕ СОЕДИНЕНИЕ Документ.ВходящаяТранспортнаяОперацияВЕТИС.МаршрутВозврата КАК Маршрут
	|		ПО ПредыдущаяПеревозка.ВариантПоиска = 2
	|		И ПредыдущаяПеревозка.Дата = Маршрут.Ссылка.Дата
	|		И Маршрут.ТипТранспорта = &ТипТранспорта
	|		И Маршрут.НомерТранспортногоСредства = &НомерТранспортногоСредства
	|		И Маршрут.НомерАвтомобильногоПрицепа = &НомерАвтомобильногоПрицепа
	|		И Маршрут.НомерАвтомобильногоКонтейнера = &НомерАвтомобильногоКонтейнера
	|		И Маршрут.Ссылка.Проведен
	|
	|ОБЪЕДИНИТЬ ВСЕ
	|
	|ВЫБРАТЬ
	|	Маршрут.Ссылка.СпособХранения,
	|	Маршрут.Ссылка.ПеревозчикХозяйствующийСубъект
	|ИЗ
	|	ПредыдущаяПеревозка КАК ПредыдущаяПеревозка
	|		ВНУТРЕННЕЕ СОЕДИНЕНИЕ Документ.ВходящаяТранспортнаяОперацияВЕТИС.Маршрут КАК Маршрут
	|		ПО ПредыдущаяПеревозка.ВариантПоиска = 3
	|		И ПредыдущаяПеревозка.Дата = Маршрут.Ссылка.Дата
	|		И Маршрут.ТипТранспорта = &ТипТранспорта
	|		И Маршрут.НомерТранспортногоСредства = &НомерТранспортногоСредства
	|		И Маршрут.НомерАвтомобильногоПрицепа = &НомерАвтомобильногоПрицепа
	|		И Маршрут.НомерАвтомобильногоКонтейнера = &НомерАвтомобильногоКонтейнера
	|		И Маршрут.Ссылка.Проведен
	|
	|ОБЪЕДИНИТЬ ВСЕ
	|
	|ВЫБРАТЬ
	|	МаршрутШапка.СпособХранения,
	|	МаршрутШапка.ПеревозчикХозяйствующийСубъект
	|ИЗ
	|	ПредыдущаяПеревозка КАК ПредыдущаяПеревозка
	|		ВНУТРЕННЕЕ СОЕДИНЕНИЕ Документ.ВходящаяТранспортнаяОперацияВЕТИС КАК МаршрутШапка
	|		ПО ПредыдущаяПеревозка.ВариантПоиска = 4
	|		И ПредыдущаяПеревозка.Дата = МаршрутШапка.Дата
	|		И МаршрутШапка.ТипТранспорта = &ТипТранспорта
	|		И МаршрутШапка.НомерТранспортногоСредства = &НомерТранспортногоСредства
	|		И МаршрутШапка.НомерАвтомобильногоПрицепа = &НомерАвтомобильногоПрицепа
	|		И МаршрутШапка.НомерАвтомобильногоКонтейнера = &НомерАвтомобильногоКонтейнера
	|		И МаршрутШапка.Проведен";
	Выборка = Запрос.Выполнить().Выбрать();
	Если Выборка.Следующий() Тогда
		ЗаполнитьЗначенияСвойств(Результат, Выборка);
	КонецЕсли;
	
	Возврат Результат;
	
КонецФункции

#КонецОбласти
